[
  "<pad>",
  "<sos>",
  "<eos>",
  "<unk>",
  "!",
  "!!",
  "\"",
  "\"Itch\"。",
  "\"Muiriel\"。",
  "\"aaah\"。",
  "\"。",
  "(",
  "(Tom)",
  ")",
  ")。",
  "+",
  ",",
  ",”",
  "-",
  ".",
  "..",
  "...",
  "......",
  "......？",
  ".NET",
  ".Net",
  ".a",
  ".art",
  ".net",
  "/",
  "0",
  "0.5",
  "0000",
  "01",
  "0:2",
  "0。",
  "1",
  "1.7",
  "10",
  "10,000",
  "100",
  "100%",
  "1000",
  "10000",
  "10086",
  "100。",
  "1014）",
  "102",
  "105",
  "1051）",
  "1053）",
  "105。",
  "1066",
  "10:30",
  "10％。",
  "11",
  "110",
  "110。",
  "110！",
  "1136",
  "114）",
  "1155",
  "1155）",
  "1173",
  "119。",
  "12",
  "120",
  "1221）",
  "13",
  "1320）",
  "13611396）",
  "137.5",
  "14",
  "140?）",
  "143）",
  "147）",
  "1492",
  "15",
  "150",
  "1500",
  "1500。",
  "150219）",
  "1539",
  "154",
  "154）",
  "155",
  "15。",
  "16",
  "1600",
  "1623）",
  "1636",
  "1642",
  "1650",
  "1689",
  "17",
  "1718）",
  "1732",
  "1789",
  "178）",
  "17901854）",
  "18",
  "180",
  "18201852）",
  "18421912）",
  "1848",
  "1860",
  "1865",
  "186）",
  "18721936）",
  "1876",
  "18831911）",
  "1888",
  "1899",
  "18）",
  "19",
  "1914",
  "1920",
  "1932",
  "1939",
  "193）",
  "1940",
  "1941",
  "1945",
  "1950",
  "1954",
  "1960",
  "1968",
  "1970",
  "1972",
  "1974",
  "1977",
  "1979",
  "1980",
  "1985",
  "1988",
  "1989",
  "1990",
  "1991",
  "1996",
  "1）",
  "2",
  "2.2",
  "20",
  "20%。",
  "200",
  "2000",
  "2001",
  "2003",
  "2005",
  "2010",
  "2013",
  "2014",
  "2018",
  "2019",
  "2022/2972",
  "2025",
  "202）",
  "204",
  "2061",
  "207）",
  "208）",
  "20。",
  "21",
  "210）",
  "212）",
  "22",
  "23",
  "232",
  "235）",
  "23）",
  "24",
  "25",
  "250",
  "251）",
  "259",
  "26",
  "27",
  "27。",
  "28",
  "287",
  "295）",
  "2:30",
  "2D",
  "2、3",
  "2：30",
  "3",
  "3%。",
  "3/4",
  "30",
  "300",
  "3000",
  "305）",
  "308",
  "30KG。",
  "310）",
  "318",
  "32",
  "328",
  "33",
  "338）",
  "34",
  "345406）",
  "36",
  "360",
  "376）",
  "381）",
  "390",
  "395）",
  "3D",
  "3d",
  "4",
  "4.0",
  "4.0BLE",
  "40",
  "40%",
  "4000",
  "40000",
  "404",
  "41",
  "414466）",
  "4412",
  "45",
  "455",
  "468",
  "473）",
  "479）",
  "49）",
  "4W",
  "5",
  "5%。",
  "5-4",
  "50",
  "500",
  "5000",
  "50000",
  "500）",
  "51",
  "518）",
  "53",
  "54",
  "551",
  "56",
  "57",
  "58",
  "589644）",
  "5％。",
  "6",
  "6%",
  "60",
  "600",
  "605664）",
  "60？",
  "637）",
  "64",
  "643）",
  "649676）",
  "65",
  "650",
  "686760",
  "69%",
  "6:30",
  "7",
  "7%。",
  "70",
  "7000",
  "715770）",
  "720",
  "730806",
  "737",
  "756）",
  "761）",
  "767",
  "782）",
  "789。",
  "789）",
  "791）",
  "799）",
  "7:30",
  "7、8",
  "7。",
  "8",
  "80",
  "800",
  "8086",
  "80x86",
  "80％",
  "830）",
  "836910）",
  "839",
  "850",
  "88",
  "8:40",
  "9",
  "90",
  "90%。",
  "900",
  "93）",
  "95",
  "978",
  "97）",
  "98",
  "99",
  ":",
  ";",
  "?",
  "?!",
  "?\"10",
  "?.",
  "??",
  "????。",
  "??。",
  "A",
  "A/B",
  "A100。",
  "A4",
  "AA",
  "ABAP",
  "AC",
  "ACM",
  "AD",
  "AE",
  "AES",
  "AI",
  "ALSA",
  "ANDROID",
  "API",
  "APK",
  "APP",
  "AR",
  "ARC",
  "ARM",
  "ARP",
  "ASCII",
  "AT",
  "ATT",
  "AVL",
  "AVR",
  "AWT",
  "ActiveReports",
  "ActiveX",
  "Activiti",
  "Activity",
  "Adapter",
  "Alex",
  "Alfred",
  "Algorithm",
  "Alice",
  "Allen",
  "Andorid",
  "Andrea。",
  "Andreescu",
  "Andriod",
  "Android",
  "AndroidUI",
  "Ania",
  "Ann",
  "Anne",
  "Aoi",
  "App",
  "AppStore",
  "Apple",
  "Apriori",
  "ArcEngine",
  "ArcGIS",
  "Asp.Net",
  "Audio",
  "Axure",
  "A。",
  "B",
  "B+",
  "BB。",
  "BF",
  "BFS",
  "BI",
  "BLE",
  "BM",
  "BP",
  "BS",
  "BUG",
  "Base64",
  "Bellman-Ford",
  "Ben",
  "Beth",
  "Beth。",
  "Betty",
  "Betty。",
  "Bill",
  "Bill，",
  "Binder",
  "Bj?rk",
  "Bluetooth",
  "Bob",
  "Bob，",
  "Boost",
  "Bootstrap",
  "Boston",
  "Brian",
  "Bug",
  "Builder",
  "Burnside",
  "Button",
  "C",
  "C#",
  "C++",
  "C++11",
  "C/C++",
  "CA",
  "CAS",
  "CCF",
  "CD",
  "CDQ",
  "CDR",
  "CD。",
  "CD，",
  "CD？",
  "CEO",
  "CG",
  "CI",
  "CMD",
  "CMS",
  "COM",
  "CRC",
  "CSDN",
  "CSS",
  "CUDA",
  "Calendar",
  "Carl",
  "Carl，",
  "Carole",
  "Catalan",
  "Cathy",
  "Cell",
  "ChemDraw",
  "Chris",
  "Chrome",
  "Class",
  "Cocoa",
  "Cocos2d-x",
  "Cocos2dx",
  "Collection",
  "Compare",
  "Cookie",
  "Coursera",
  "Crouch",
  "C。",
  "DB",
  "DB2",
  "DES",
  "DFS",
  "DHL",
  "DJ",
  "DNA",
  "DNS",
  "DOM",
  "DOS",
  "DP",
  "DRP",
  "DSP",
  "DVD.",
  "DVD。",
  "DVD？",
  "Dalvik",
  "Dan",
  "Dana。",
  "Daniel",
  "Dan。",
  "Darcy",
  "Date",
  "Davis",
  "Debug",
  "Delphi",
  "Demo",
  "Derry",
  "Dev",
  "DevExpress",
  "Dialog",
  "Dijkstra",
  "Dinic",
  "Dll",
  "Docker",
  "Donna",
  "Dorothy",
  "Dos",
  "Drum）",
  "E-R",
  "EAS",
  "EL",
  "EM",
  "ER",
  "ERP",
  "EXCEL",
  "Eclipse",
  "EditText",
  "Edward。",
  "Elen",
  "Emi",
  "Emily?",
  "Eric",
  "Erlang",
  "EtherCAT",
  "Excel",
  "Exception",
  "FIX",
  "FPGA",
  "Fabien",
  "Facebook",
  "Facebook？",
  "Felicja",
  "Fibonacci",
  "File",
  "Fiona",
  "Flash",
  "Flex",
  "Florence？",
  "Floyd",
  "Form",
  "Foundation",
  "Fragment",
  "Fred。",
  "Freeman",
  "Fritz。",
  "Fundation",
  "GC",
  "GCC",
  "GCD",
  "GDB",
  "GDOI",
  "GET",
  "GIF",
  "GIS",
  "GO",
  "GOF23",
  "GP",
  "GPS",
  "GPU",
  "GUI",
  "GZIP",
  "George",
  "Georges,",
  "Gerrit",
  "Get",
  "Git",
  "Go",
  "Golang",
  "Google",
  "Gson",
  "H5",
  "HA",
  "HOG",
  "HTML",
  "HTML5",
  "HTTP",
  "HTTPS",
  "Hadoop",
  "Handler",
  "Hash",
  "Helen",
  "HelloX",
  "Helper",
  "Henri",
  "Hibernate",
  "Hill",
  "Home",
  "Hopkins。",
  "Hough",
  "Http",
  "Huffman",
  "Humppa",
  "Hunter。",
  "I",
  "I2C",
  "IAA",
  "IBM",
  "IC",
  "IDE",
  "IDF",
  "IE",
  "IIS",
  "IM",
  "INS",
  "IO",
  "IOS",
  "IP",
  "IPC",
  "IPhone",
  "ISO8583",
  "IT",
  "ITOO",
  "Ichiro",
  "ImageView",
  "Intel",
  "Intent",
  "IoT",
  "Ios",
  "Iphone",
  "Irakli",
  "Iris，",
  "Ishmael。",
  "J2EE",
  "JAVA",
  "JDK",
  "JEECG",
  "JNI",
  "JQUERY",
  "JQuery",
  "JS",
  "JSON",
  "JSP",
  "JST",
  "JSTL",
  "JUDY",
  "JUnit",
  "JVM",
  "Jack",
  "Jack。",
  "Jacques",
  "Jake",
  "Jane",
  "Java",
  "Java7",
  "JavaEE",
  "JavaSE",
  "JavaScript",
  "JavaWeb",
  "Javascript",
  "Jean",
  "Jeff",
  "Jenkins",
  "Jessie",
  "Jessie。",
  "Jim",
  "Jimmy",
  "Jiro",
  "Joe",
  "John",
  "Johnnie。",
  "John。",
  "Jorge",
  "Jquery",
  "Json",
  "Jsp",
  "Juan",
  "Juba。",
  "Juddy",
  "Judy",
  "Judy。",
  "Julia",
  "Julián",
  "Junit",
  "K",
  "KD",
  "KM",
  "KMP",
  "KNN",
  "Karima",
  "Karin",
  "Karlo",
  "Kate",
  "Kate,",
  "Ken",
  "Kenchan。",
  "Kent",
  "Ken。",
  "Kim",
  "Koushien",
  "Kruskal",
  "L",
  "LAMP",
  "LCA",
  "LCD",
  "LED",
  "LINUX",
  "LZH",
  "Lambda",
  "Laravel",
  "Laurie",
  "Layla",
  "LeetCode",
  "Libusza",
  "Lidia",
  "Linda",
  "Linux",
  "Linux!",
  "Linux/Unix",
  "LinuxC",
  "Linux。",
  "Lisp",
  "List",
  "ListView",
  "Logistic",
  "Look",
  "Lua",
  "Lucas",
  "Lucy",
  "Ludwig。",
  "Luis。",
  "Luke，",
  "Lynn",
  "MAC",
  "MATLAB",
  "MD5",
  "MFC",
  "MM",
  "MOOC",
  "MP3",
  "MQ",
  "MTK",
  "MVC",
  "MVP",
  "MYSQL",
  "Mac",
  "Makefile",
  "Maki",
  "Manacher",
  "Map",
  "MapReduce",
  "Marco",
  "Marconi",
  "Mari",
  "Maria",
  "Marie",
  "Marina",
  "Mario",
  "Markdown",
  "Marta",
  "Mary",
  "Mary?",
  "Mary。",
  "María",
  "Masao",
  "Masao?",
  "Math",
  "MathType",
  "Matlab",
  "Maven",
  "Mayuko",
  "Mayuko.",
  "Mayuko。",
  "Meg",
  "Meg，",
  "Melissa",
  "Midori",
  "Mike",
  "Mike，",
  "Mina",
  "Mobile",
  "MongoDB",
  "Muiriel",
  "MyBatis",
  "MyEclipse",
  "MySQL",
  "MySql",
  "Mysql",
  "N",
  "NDK",
  "NET",
  "NFC",
  "NOIP",
  "NOIP2013",
  "NP",
  "NTT",
  "Nancy",
  "Nancy。",
  "Naomi",
  "Navicat",
  "Nginx",
  "Nick",
  "Nicole",
  "Nim",
  "NoSQL",
  "Nothing",
  "OA",
  "OB？",
  "OC",
  "OCCS",
  "OCR",
  "OFFER",
  "OJ",
  "OK",
  "OO",
  "ORACLE",
  "ORM",
  "OS",
  "OSS",
  "Object",
  "Object-C",
  "Object-c",
  "ObjectARX",
  "Objective-C",
  "Objective-c",
  "Ogai",
  "Omid。",
  "Online",
  "OpenCL",
  "OpenCV",
  "OpenGL",
  "Openstack",
  "Oracle",
  "Oralce",
  "P2P",
  "PAT",
  "PC",
  "PCA",
  "PCB",
  "PCH",
  "PCIe",
  "PCL",
  "PDF",
  "PE",
  "PHP",
  "PKI",
  "PKO",
  "PL/SQL",
  "PLC",
  "POSIX",
  "POST",
  "PP",
  "PTA",
  "PV",
  "Pascal",
  "Patricia。",
  "Patty",
  "Paul",
  "Paula",
  "Perl",
  "Peter",
  "Phalcon",
  "Photoshop",
  "Play",
  "Plugin",
  "Pochi。",
  "Polya",
  "Popeye。",
  "Post",
  "Prim",
  "Primer",
  "Properties",
  "Pull",
  "Python",
  "Python!",
  "QQ",
  "QT",
  "Qt",
  "Quartz2D",
  "Q。",
  "R",
  "REST",
  "RFID",
  "RMQ",
  "RN",
  "ROM",
  "ROS",
  "RPC",
  "RSA",
  "RTMP",
  "RTOS",
  "Redis",
  "Relay",
  "Revit",
  "Rich",
  "Ron",
  "Rubén",
  "Runnable",
  "Runtime",
  "Ruriko",
  "Rushia，",
  "SAT",
  "SAX",
  "SD",
  "SDK",
  "SDN",
  "SEO",
  "SFX",
  "SG",
  "SIFT",
  "SIM",
  "SIP",
  "SM2",
  "SPFA",
  "SQL",
  "SQLServer",
  "SQLite",
  "SSD",
  "SSH",
  "SSL",
  "SSM",
  "SSO",
  "ST",
  "STL",
  "STM32",
  "SVN",
  "SaaS",
  "Sakura",
  "Sam",
  "Sami",
  "Sato",
  "Scala",
  "Seiko",
  "Server",
  "Servlet",
  "Set",
  "ShareSDK",
  "Shell",
  "Simpson",
  "Skipper。",
  "Skype",
  "Smith",
  "Socket",
  "Spark",
  "Spike。",
  "Splay",
  "Spot",
  "Spring",
  "Sql",
  "SqlServer",
  "Stefan。",
  "Steve",
  "String",
  "Struts",
  "Struts2",
  "Studio",
  "Sue",
  "Sunday",
  "Suzanne",
  "Swift",
  "System",
  "T",
  "TCP",
  "TCP-IP",
  "TCP/IP",
  "TCPIP",
  "TF",
  "TOM",
  "TP",
  "TS",
  "TSP",
  "TV",
  "Take?i",
  "Takeo",
  "Takesi",
  "Tama",
  "Tanabe",
  "Tarjan",
  "Taro",
  "Taro。",
  "Tatoeba",
  "Tatoeba!",
  "Tatoeba。",
  "Ted",
  "Ted。",
  "Teodoro",
  "ThinkPHP",
  "Thinkphp",
  "Thread",
  "Tim",
  "Timu?in",
  "Tire",
  "Tk",
  "Toast",
  "Tom",
  "Tom,",
  "Tomcat",
  "Tom。",
  "Tom，",
  "Tom？",
  "Tony",
  "Tony，",
  "Touch",
  "Toyota",
  "Trie",
  "Twitter。",
  "U",
  "U3D",
  "UDP",
  "UF",
  "UFLDL",
  "UFO",
  "UI",
  "UIKit",
  "UIView",
  "UK",
  "UML",
  "UN",
  "UNIX",
  "URL",
  "USB",
  "Ubuntu",
  "Ueno",
  "Unity",
  "Unity3D",
  "Unity3d",
  "Unix",
  "Unix/Linux",
  "Uno",
  "VC",
  "VC++",
  "VELT",
  "VFD",
  "VMware",
  "VR",
  "VS",
  "View",
  "ViewGroup",
  "Vim",
  "Volley",
  "W3C",
  "WCF",
  "WDK",
  "WEB",
  "WINDOWS",
  "WP",
  "WPF",
  "Watch",
  "Web",
  "WebForm",
  "WebService",
  "Whistle）",
  "WiFi",
  "Wifi",
  "Win32",
  "Window",
  "Windows",
  "Wood",
  "WordPress",
  "X",
  "XML",
  "XMPP",
  "XSS",
  "XXX",
  "XYZ",
  "Xcode",
  "YII",
  "YY",
  "Yanni",
  "Yatarou.",
  "Yii",
  "Yotchan。",
  "Youtube",
  "Yukiko",
  "Yumi",
  "_",
  "`",
  "a",
  "a1",
  "a2",
  "a3",
  "a4",
  "ab",
  "ac",
  "access",
  "acm",
  "activiti",
  "activity",
  "adapter",
  "adb",
  "ai1",
  "ai2",
  "ai3",
  "ai4",
  "ajax",
  "an1",
  "an2",
  "an3",
  "an4",
  "andriod",
  "android",
  "ang1",
  "ang2",
  "ang4",
  "animation",
  "ansible",
  "ant",
  "ao1",
  "ao2",
  "ao3",
  "ao4",
  "apache",
  "api",
  "apk",
  "app",
  "appium",
  "arm",
  "ascii",
  "asp.net",
  "assets",
  "awk",
  "axure",
  "b",
  "ba",
  "ba1",
  "ba2",
  "ba3",
  "ba4",
  "back",
  "bag",
  "bai1",
  "bai2",
  "bai3",
  "bai4",
  "ban",
  "ban1",
  "ban3",
  "ban4",
  "bang1",
  "bang3",
  "bang4",
  "bao1",
  "bao2",
  "bao3",
  "bao4",
  "bash",
  "bat",
  "bean",
  "bei",
  "bei1",
  "bei3",
  "bei4",
  "ben1",
  "ben3",
  "ben4",
  "beng",
  "beng1",
  "beng2",
  "beng3",
  "beng4",
  "bfs",
  "bi1",
  "bi2",
  "bi3",
  "bi4",
  "bian",
  "bian1",
  "bian3",
  "bian4",
  "biao1",
  "biao3",
  "biao4",
  "bie1",
  "bie2",
  "bie3",
  "bie4",
  "bin",
  "bin1",
  "bin4",
  "bing1",
  "bing3",
  "bing4",
  "block",
  "bo",
  "bo1",
  "bo2",
  "bo3",
  "bo4",
  "boost",
  "bootstrap",
  "boy！",
  "bu1",
  "bu2",
  "bu3",
  "bu4",
  "bug",
  "b：）",
  "c",
  "c#",
  "c++",
  "c3p0",
  "ca1",
  "ca3",
  "ca4",
  "caffe",
  "cai1",
  "cai2",
  "cai3",
  "cai4",
  "can1",
  "can2",
  "can3",
  "can4",
  "cang1",
  "cang2",
  "cang3",
  "cang4",
  "cao1",
  "cao2",
  "cao3",
  "cao4",
  "cas",
  "cdq",
  "ce",
  "ce4",
  "cell",
  "cen1",
  "cen2",
  "ceng1",
  "ceng2",
  "ceng4",
  "ceph",
  "cha1",
  "cha2",
  "cha3",
  "cha4",
  "chai1",
  "chai2",
  "chai3",
  "chai4",
  "chan1",
  "chan2",
  "chan3",
  "chan4",
  "chang",
  "chang1",
  "chang2",
  "chang3",
  "chang4",
  "chao1",
  "chao2",
  "chao3",
  "chao4",
  "che1",
  "che3",
  "che4",
  "cheese",
  "chen",
  "chen1",
  "chen2",
  "chen3",
  "chen4",
  "cheng1",
  "cheng2",
  "cheng3",
  "cheng4",
  "chi",
  "chi1",
  "chi2",
  "chi3",
  "chi4",
  "chong1",
  "chong2",
  "chong3",
  "chong4",
  "chou1",
  "chou2",
  "chou3",
  "chou4",
  "chrome",
  "chu",
  "chu1",
  "chu2",
  "chu3",
  "chu4",
  "chua1",
  "chuai1",
  "chuai2",
  "chuai3",
  "chuai4",
  "chuan1",
  "chuan2",
  "chuan3",
  "chuan4",
  "chuang1",
  "chuang2",
  "chuang3",
  "chuang4",
  "chui1",
  "chui2",
  "chui4",
  "chun1",
  "chun2",
  "chun3",
  "chuo1",
  "chuo4",
  "ci",
  "ci1",
  "ci2",
  "ci3",
  "ci4",
  "click",
  "cmd",
  "cms",
  "cocoapods",
  "cocos2d-x",
  "cocos2dx",
  "com",
  "cong1",
  "cong2",
  "cong4",
  "const",
  "cookie",
  "cou1",
  "cou3",
  "cou4",
  "cron",
  "csdn",
  "css",
  "css3",
  "cu1",
  "cu2",
  "cu3",
  "cu4",
  "cuan1",
  "cuan2",
  "cuan4",
  "cui",
  "cui1",
  "cui3",
  "cui4",
  "cun1",
  "cun2",
  "cun3",
  "cun4",
  "cuo1",
  "cuo2",
  "cuo3",
  "cuo4",
  "d",
  "da",
  "da1",
  "da2",
  "da3",
  "da4",
  "dai",
  "dai1",
  "dai3",
  "dai4",
  "dan1",
  "dan3",
  "dan4",
  "dang",
  "dang1",
  "dang3",
  "dang4",
  "dao1",
  "dao2",
  "dao3",
  "dao4",
  "db",
  "ddos",
  "de",
  "de1",
  "de2",
  "dedecms",
  "dei1",
  "dei3",
  "delphi",
  "demo",
  "den4",
  "deng1",
  "deng3",
  "deng4",
  "dfs",
  "di1",
  "di2",
  "di3",
  "di4",
  "dia3",
  "dialog",
  "dian1",
  "dian3",
  "dian4",
  "diao1",
  "diao3",
  "diao4",
  "die1",
  "die2",
  "die3",
  "die4",
  "dijkstra",
  "ding1",
  "ding3",
  "ding4",
  "diu1",
  "div",
  "django",
  "dns",
  "dom",
  "dong1",
  "dong3",
  "dong4",
  "dos",
  "dou1",
  "dou3",
  "dou4",
  "double",
  "dp",
  "driver",
  "du1",
  "du2",
  "du3",
  "du4",
  "duan1",
  "duan3",
  "duan4",
  "dui1",
  "dui3",
  "dui4",
  "dun1",
  "dun3",
  "dun4",
  "duo1",
  "duo2",
  "duo3",
  "duo4",
  "dwr",
  "e",
  "e1",
  "e2",
  "e3",
  "e4",
  "eBay",
  "eclipse",
  "ecshop",
  "ei1",
  "ei2",
  "ei3",
  "ei4",
  "el",
  "emoji",
  "en1",
  "en3",
  "en4",
  "eng1",
  "er",
  "er2",
  "er3",
  "er4",
  "error",
  "excel",
  "exit",
  "f",
  "fa1",
  "fa2",
  "fa3",
  "fa4",
  "fail",
  "fan1",
  "fan2",
  "fan3",
  "fan4",
  "fang",
  "fang1",
  "fang2",
  "fang3",
  "fang4",
  "fda1（?231）",
  "fda3",
  "fda4",
  "fda6",
  "fda7",
  "fdaaＪ",
  "fdab",
  "fdb1",
  "fdb2",
  "fdb4",
  "fdb7",
  "fdb9",
  "fdbc",
  "fdbe６",
  "fdbf（1928",
  "fdc4（ｃｕī－）",
  "fde3",
  "fdee",
  "fdef",
  "fdf4",
  "feab",
  "feac",
  "febe（ā－）",
  "febf",
  "fei1",
  "fei2",
  "fei3",
  "fei4",
  "fen1",
  "fen2",
  "fen3",
  "fen4",
  "feng1",
  "feng2",
  "feng3",
  "feng4",
  "fiao4",
  "file",
  "final",
  "find",
  "firefox",
  "flex",
  "floyd",
  "fo2",
  "for",
  "fork",
  "form",
  "fou1",
  "fou2",
  "fou3",
  "fragment",
  "ftp",
  "fu",
  "fu1",
  "fu2",
  "fu3",
  "fu4",
  "g",
  "ga1",
  "ga2",
  "ga3",
  "ga4",
  "gai1",
  "gai3",
  "gai4",
  "gan1",
  "gan3",
  "gan4",
  "gang1",
  "gang3",
  "gang4",
  "gao1",
  "gao3",
  "gao4",
  "gcc",
  "gdb",
  "ge1",
  "ge2",
  "ge3",
  "ge4",
  "gei3",
  "gen1",
  "gen2",
  "gen3",
  "gen4",
  "geng1",
  "geng3",
  "geng4",
  "get",
  "gif",
  "git",
  "go",
  "gong",
  "gong1",
  "gong3",
  "gong4",
  "google",
  "gou1",
  "gou3",
  "gou4",
  "gp",
  "gps",
  "gradle",
  "gu",
  "gu1",
  "gu2",
  "gu3",
  "gu4",
  "gua1",
  "gua3",
  "gua4",
  "guai1",
  "guai3",
  "guai4",
  "guan1",
  "guan3",
  "guan4",
  "guang",
  "guang1",
  "guang3",
  "guang4",
  "gui",
  "gui1",
  "gui3",
  "gui4",
  "gun3",
  "gun4",
  "guo",
  "guo1",
  "guo2",
  "guo3",
  "guo4",
  "h",
  "h5",
  "ha1",
  "ha2",
  "ha3",
  "ha4",
  "hadoop",
  "hai",
  "hai1",
  "hai2",
  "hai3",
  "hai4",
  "han",
  "han1",
  "han2",
  "han3",
  "han4",
  "handler",
  "hang1",
  "hang2",
  "hang3",
  "hang4",
  "hao1",
  "hao2",
  "hao3",
  "hao4",
  "hash",
  "hbase",
  "he1",
  "he2",
  "he4",
  "hei1",
  "hen1",
  "hen2",
  "hen3",
  "hen4",
  "heng1",
  "heng2",
  "heng4",
  "hibernate",
  "hiho",
  "hive",
  "hm",
  "hng",
  "home",
  "hong1",
  "hong2",
  "hong3",
  "hong4",
  "hou1",
  "hou2",
  "hou3",
  "hou4",
  "hough",
  "html",
  "html5",
  "hu1",
  "hu2",
  "hu3",
  "hu4",
  "hua1",
  "hua2",
  "hua4",
  "huai",
  "huai2",
  "huai4",
  "huan1",
  "huan2",
  "huan3",
  "huan4",
  "huang",
  "huang1",
  "huang2",
  "huang3",
  "huang4",
  "huffman",
  "hui",
  "hui1",
  "hui2",
  "hui3",
  "hui4",
  "hun1",
  "hun2",
  "hun3",
  "hun4",
  "huo",
  "huo1",
  "huo2",
  "huo3",
  "huo4",
  "i",
  "iOS",
  "iOS/Mac",
  "iOS9",
  "iPad",
  "iPhone",
  "ide",
  "ie",
  "if",
  "include",
  "input",
  "io",
  "ios",
  "ip",
  "ipad",
  "iphone",
  "iso",
  "j",
  "j2ee",
  "jQuery",
  "jar",
  "java",
  "javaWeb",
  "javascript",
  "javaweb",
  "jdk",
  "ji",
  "ji1",
  "ji2",
  "ji3",
  "ji4",
  "jia",
  "jia1",
  "jia2",
  "jia3",
  "jia4",
  "jian",
  "jian1",
  "jian3",
  "jian4",
  "jiang",
  "jiang1",
  "jiang3",
  "jiang4",
  "jiao",
  "jiao1",
  "jiao2",
  "jiao3",
  "jiao4",
  "jie",
  "jie1",
  "jie2",
  "jie3",
  "jie4",
  "jin1",
  "jin3",
  "jin4",
  "jing",
  "jing1",
  "jing3",
  "jing4",
  "jiong1",
  "jiong3",
  "jiu",
  "jiu1",
  "jiu3",
  "jiu4",
  "jpg",
  "jquery",
  "js",
  "json",
  "jsp",
  "jstl",
  "ju",
  "ju1",
  "ju2",
  "ju3",
  "ju4",
  "juan1",
  "juan3",
  "juan4",
  "jue1",
  "jue2",
  "jue3",
  "jue4",
  "jun1",
  "jun4",
  "junit",
  "jvm",
  "k",
  "k-",
  "ka1",
  "ka3",
  "kai1",
  "kai3",
  "kai4",
  "kan1",
  "kan3",
  "kan4",
  "kang1",
  "kang2",
  "kang3",
  "kang4",
  "kao1",
  "kao3",
  "kao4",
  "kd",
  "ke",
  "ke1",
  "ke2",
  "ke3",
  "ke4",
  "kei1",
  "ken",
  "ken3",
  "ken4",
  "keng1",
  "keng3",
  "kernel",
  "km",
  "kmp",
  "kong1",
  "kong3",
  "kong4",
  "kou1",
  "kou3",
  "kou4",
  "kruskal",
  "ku1",
  "ku3",
  "ku4",
  "kua1",
  "kua3",
  "kua4",
  "kuai3",
  "kuai4",
  "kuan1",
  "kuan3",
  "kuang1",
  "kuang2",
  "kuang3",
  "kuang4",
  "kui1",
  "kui2",
  "kui3",
  "kui4",
  "kun",
  "kun1",
  "kun3",
  "kun4",
  "kuo4",
  "l",
  "la",
  "la1",
  "la2",
  "la3",
  "la4",
  "lai2",
  "lai4",
  "lambda",
  "lan2",
  "lan3",
  "lan4",
  "lang",
  "lang1",
  "lang2",
  "lang3",
  "lang4",
  "lao1",
  "lao2",
  "lao3",
  "lao4",
  "laravel",
  "le",
  "le1",
  "le4",
  "led",
  "leetcode",
  "lei",
  "lei1",
  "lei2",
  "lei3",
  "lei4",
  "len4",
  "leng1",
  "leng2",
  "leng3",
  "leng4",
  "li",
  "li1",
  "li2",
  "li3",
  "li4",
  "lia3",
  "lian2",
  "lian3",
  "lian4",
  "liang",
  "liang2",
  "liang3",
  "liang4",
  "liao1",
  "liao2",
  "liao3",
  "liao4",
  "libevent",
  "lie",
  "lie1",
  "lie2",
  "lie3",
  "lie4",
  "lin1",
  "lin2",
  "lin3",
  "lin4",
  "ling",
  "ling1",
  "ling2",
  "ling3",
  "ling4",
  "linux",
  "linxu",
  "list",
  "listview",
  "liu1",
  "liu2",
  "liu3",
  "liu4",
  "lo",
  "loading",
  "log",
  "log4j",
  "logistic",
  "long1",
  "long2",
  "long3",
  "long4",
  "lou",
  "lou1",
  "lou2",
  "lou3",
  "lou4",
  "ls",
  "lu",
  "lu1",
  "lu2",
  "lu3",
  "lu4",
  "luan2",
  "luan3",
  "luan4",
  "lucas",
  "lun1",
  "lun2",
  "lun3",
  "lun4",
  "luo",
  "luo1",
  "luo2",
  "luo3",
  "luo4",
  "lv2",
  "lv3",
  "lv4",
  "lve3",
  "lve4",
  "l：",
  "m1",
  "m2",
  "m4",
  "ma",
  "ma1",
  "ma2",
  "ma3",
  "ma4",
  "mac",
  "mai2",
  "mai3",
  "mai4",
  "main",
  "man1",
  "man2",
  "man3",
  "man4",
  "manacher",
  "mang1",
  "mang2",
  "mang3",
  "mang4",
  "mao1",
  "mao2",
  "mao3",
  "mao4",
  "map",
  "markdown",
  "matlab",
  "matplotlib",
  "maven",
  "md5",
  "me",
  "me1",
  "mei2",
  "mei3",
  "mei4",
  "men",
  "men1",
  "men2",
  "men4",
  "meng",
  "meng1",
  "meng2",
  "meng3",
  "meng4",
  "meta",
  "mi1",
  "mi2",
  "mi3",
  "mi4",
  "mian2",
  "mian3",
  "mian4",
  "miao1",
  "miao2",
  "miao3",
  "miao4",
  "mie",
  "mie1",
  "mie4",
  "min",
  "min2",
  "min3",
  "mina",
  "ming",
  "ming2",
  "ming3",
  "ming4",
  "mini2440",
  "miu4",
  "mo",
  "mo1",
  "mo2",
  "mo3",
  "mo4",
  "mongodb",
  "monkey",
  "mou1",
  "mou2",
  "mou3",
  "mtk",
  "mu2",
  "mu3",
  "mu4",
  "mvc",
  "mybatis",
  "myeclipse",
  "mysql",
  "m：",
  "n",
  "n2",
  "n3",
  "n4",
  "na",
  "na1",
  "na2",
  "na3",
  "na4",
  "nai2",
  "nai3",
  "nai4",
  "nan1",
  "nan2",
  "nan3",
  "nan4",
  "nang",
  "nang1",
  "nang2",
  "nang3",
  "nang4",
  "nao1",
  "nao2",
  "nao3",
  "nao4",
  "ne",
  "ne2",
  "ne4",
  "nei3",
  "nei4",
  "nen4",
  "neng2",
  "neng3",
  "next",
  "ng",
  "ng2",
  "ng3",
  "ng4",
  "nginx",
  "ni1",
  "ni2",
  "ni3",
  "ni4",
  "nian1",
  "nian2",
  "nian3",
  "nian4",
  "niang2",
  "niang4",
  "niao3",
  "niao4",
  "nie1",
  "nie2",
  "nie3",
  "nie4",
  "nin",
  "nin2",
  "nin3",
  "ning2",
  "ning3",
  "ning4",
  "niu1",
  "niu2",
  "niu3",
  "niu4",
  "noip",
  "nong2",
  "nong3",
  "nong4",
  "nosql",
  "note",
  "nou2",
  "nou3",
  "nou4",
  "nu2",
  "nu3",
  "nu4",
  "nuan2",
  "nuan3",
  "nuan4",
  "nun2",
  "nun4",
  "nuo2",
  "nuo3",
  "nuo4",
  "nv3",
  "nv4",
  "nve4",
  "n：",
  "o",
  "o1",
  "o2",
  "o3",
  "o4",
  "oa",
  "objective-c",
  "oc",
  "offer",
  "oj",
  "ok",
  "onvif",
  "openCV",
  "opencv",
  "ora",
  "oracle",
  "orm",
  "os",
  "osgi",
  "ou",
  "ou1",
  "ou2",
  "ou3",
  "ou4",
  "p",
  "p2p",
  "pa1",
  "pa2",
  "pa4",
  "pai1",
  "pai2",
  "pai3",
  "pai4",
  "pan1",
  "pan2",
  "pan3",
  "pan4",
  "pang1",
  "pang2",
  "pang3",
  "pang4",
  "pao1",
  "pao2",
  "pao3",
  "pao4",
  "party。",
  "pc",
  "pch",
  "pdf",
  "pei1",
  "pei2",
  "pei3",
  "pei4",
  "pen1",
  "pen2",
  "pen3",
  "pen4",
  "peng1",
  "peng2",
  "peng3",
  "peng4",
  "photoshop",
  "php",
  "pi1",
  "pi2",
  "pi3",
  "pi4",
  "pian1",
  "pian2",
  "pian3",
  "pian4",
  "piao1",
  "piao2",
  "piao3",
  "piao4",
  "pie1",
  "pie3",
  "pie4",
  "pin1",
  "pin2",
  "pin3",
  "pin4",
  "ping1",
  "ping2",
  "ping3",
  "ping4",
  "plist",
  "po",
  "po1",
  "po2",
  "po3",
  "po4",
  "poj",
  "polya",
  "post",
  "postgresql",
  "pou1",
  "pou2",
  "pou3",
  "pou4",
  "prim",
  "prime",
  "proc",
  "properties",
  "ps",
  "pu",
  "pu1",
  "pu2",
  "pu3",
  "pu4",
  "pull",
  "python",
  "p：ng",
  "q",
  "qi",
  "qi1",
  "qi2",
  "qi3",
  "qi4",
  "qia1",
  "qia2",
  "qia3",
  "qia4",
  "qian",
  "qian1",
  "qian2",
  "qian3",
  "qian4",
  "qiang1",
  "qiang2",
  "qiang3",
  "qiang4",
  "qiao1",
  "qiao2",
  "qiao3",
  "qiao4",
  "qie1",
  "qie2",
  "qie3",
  "qie4",
  "qin1",
  "qin2",
  "qin3",
  "qin4",
  "qing",
  "qing1",
  "qing2",
  "qing3",
  "qing4",
  "qiong1",
  "qiong2",
  "qiu1",
  "qiu2",
  "qiu3",
  "qiu4",
  "qq",
  "qt",
  "qu",
  "qu1",
  "qu2",
  "qu3",
  "qu4",
  "quan",
  "quan1",
  "quan2",
  "quan3",
  "quan4",
  "quartz",
  "que1",
  "que2",
  "que4",
  "queue",
  "qun1",
  "qun2",
  "qun3",
  "r",
  "ran2",
  "ran3",
  "rang1",
  "rang2",
  "rang3",
  "rang4",
  "rao2",
  "rao3",
  "rao4",
  "re",
  "re2",
  "re3",
  "re4",
  "red5",
  "redis",
  "ren2",
  "ren3",
  "ren4",
  "reng1",
  "reng2",
  "reng4",
  "resin",
  "ri4",
  "rong",
  "rong1",
  "rong2",
  "rong3",
  "rong4",
  "root",
  "rou2",
  "rou3",
  "rou4",
  "rpm",
  "ru",
  "ru2",
  "ru3",
  "ru4",
  "rua2",
  "ruan2",
  "ruan3",
  "ruan4",
  "rui2",
  "rui3",
  "rui4",
  "run2",
  "run4",
  "ruo2",
  "ruo4",
  "s",
  "sa1",
  "sa3",
  "sa4",
  "sai1",
  "sai4",
  "san",
  "san1",
  "san3",
  "san4",
  "sang1",
  "sang3",
  "sang4",
  "sao1",
  "sao3",
  "sao4",
  "sax",
  "scala",
  "sd",
  "sdk",
  "se1",
  "se4",
  "sed",
  "select",
  "sen1",
  "sen3",
  "seng1",
  "seo",
  "server",
  "servlet",
  "session",
  "set",
  "sg",
  "sha",
  "sha1",
  "sha2",
  "sha3",
  "sha4",
  "shai1",
  "shai3",
  "shai4",
  "shan1",
  "shan3",
  "shan4",
  "shang",
  "shang1",
  "shang3",
  "shang4",
  "shao1",
  "shao2",
  "shao3",
  "shao4",
  "she1",
  "she2",
  "she3",
  "she4",
  "shei2",
  "shell",
  "shen1",
  "shen2",
  "shen3",
  "shen4",
  "sheng1",
  "sheng2",
  "sheng3",
  "sheng4",
  "shi",
  "shi1",
  "shi2",
  "shi3",
  "shi4",
  "shou",
  "shou1",
  "shou2",
  "shou3",
  "shou4",
  "shu1",
  "shu2",
  "shu3",
  "shu4",
  "shua1",
  "shua3",
  "shua4",
  "shuai1",
  "shuai3",
  "shuai4",
  "shuan1",
  "shuan4",
  "shuang1",
  "shuang3",
  "shuang4",
  "shui",
  "shui2",
  "shui3",
  "shui4",
  "shun3",
  "shun4",
  "shuo1",
  "shuo2",
  "shuo4",
  "si",
  "si1",
  "si3",
  "si4",
  "so",
  "socket",
  "song1",
  "song2",
  "song3",
  "song4",
  "sort",
  "sos",
  "sou1",
  "sou3",
  "sou4",
  "spark",
  "spring",
  "springMVC",
  "springmvc",
  "sql",
  "sqlite",
  "ssh",
  "ssl",
  "ssm",
  "st",
  "static",
  "stl",
  "stm32",
  "string",
  "struts",
  "struts2",
  "studio",
  "su1",
  "su2",
  "su4",
  "suan1",
  "suan3",
  "suan4",
  "sublime",
  "sui1",
  "sui2",
  "sui3",
  "sui4",
  "sun",
  "sun1",
  "sun3",
  "sun4",
  "suo",
  "suo1",
  "suo3",
  "suo4",
  "super",
  "svn",
  "swift",
  "switch",
  "system",
  "t",
  "ta",
  "ta1",
  "ta2",
  "ta3",
  "ta4",
  "tab",
  "tai",
  "tai1",
  "tai2",
  "tai3",
  "tai4",
  "tan1",
  "tan2",
  "tan3",
  "tan4",
  "tang1",
  "tang2",
  "tang3",
  "tang4",
  "tao1",
  "tao2",
  "tao3",
  "tao4",
  "tarjan",
  "te",
  "te4",
  "tei1",
  "teng1",
  "teng2",
  "teng4",
  "thinkphp",
  "this",
  "ti",
  "ti1",
  "ti2",
  "ti3",
  "ti4",
  "tian1",
  "tian2",
  "tian3",
  "tian4",
  "tiao",
  "tiao1",
  "tiao2",
  "tiao3",
  "tiao4",
  "tie1",
  "tie3",
  "tie4",
  "ting1",
  "ting2",
  "ting3",
  "ting4",
  "tips",
  "tire",
  "tom",
  "tomcat",
  "tong1",
  "tong2",
  "tong3",
  "tong4",
  "top",
  "tou",
  "tou1",
  "tou2",
  "tou3",
  "tou4",
  "touch",
  "tp",
  "transient",
  "trie",
  "tu",
  "tu1",
  "tu2",
  "tu3",
  "tu4",
  "tuan1",
  "tuan2",
  "tuan3",
  "tuan4",
  "tui1",
  "tui2",
  "tui3",
  "tui4",
  "tun1",
  "tun2",
  "tun3",
  "tun4",
  "tuo1",
  "tuo2",
  "tuo3",
  "tuo4",
  "txt",
  "u",
  "u-boot",
  "uboot",
  "ubuntu",
  "uc",
  "ui",
  "uikit",
  "uml",
  "unity",
  "unity3d",
  "unix",
  "url",
  "usb",
  "v",
  "vc",
  "vi",
  "view",
  "vim",
  "vmware",
  "void",
  "vs2010",
  "w",
  "wa",
  "wa1",
  "wa2",
  "wa3",
  "wa4",
  "wai1",
  "wai3",
  "wai4",
  "wan1",
  "wan2",
  "wan3",
  "wan4",
  "wang1",
  "wang2",
  "wang3",
  "wang4",
  "war",
  "web",
  "webapp",
  "webservice",
  "wei",
  "wei1",
  "wei2",
  "wei3",
  "wei4",
  "wen",
  "wen1",
  "wen2",
  "wen3",
  "wen4",
  "weng1",
  "weng3",
  "weng4",
  "while",
  "wifi",
  "win",
  "win32",
  "win7",
  "window",
  "windows",
  "winform",
  "wo1",
  "wo3",
  "wo4",
  "wordpress",
  "wu",
  "wu1",
  "wu2",
  "wu3",
  "wu4",
  "x",
  "x264",
  "x86",
  "xcode",
  "xi1",
  "xi2",
  "xi3",
  "xi4",
  "xia1",
  "xia2",
  "xia3",
  "xia4",
  "xian",
  "xian1",
  "xian2",
  "xian3",
  "xian4",
  "xiang1",
  "xiang2",
  "xiang3",
  "xiang4",
  "xiao",
  "xiao1",
  "xiao2",
  "xiao3",
  "xiao4",
  "xie1",
  "xie2",
  "xie3",
  "xie4",
  "xin",
  "xin1",
  "xin2",
  "xin3",
  "xin4",
  "xing",
  "xing1",
  "xing2",
  "xing3",
  "xing4",
  "xiong1",
  "xiong2",
  "xiong3",
  "xiong4",
  "xiu1",
  "xiu2",
  "xiu3",
  "xiu4",
  "xml",
  "xss",
  "xu",
  "xu1",
  "xu2",
  "xu3",
  "xu4",
  "xuan1",
  "xuan2",
  "xuan3",
  "xuan4",
  "xue1",
  "xue2",
  "xue3",
  "xue4",
  "xun1",
  "xun2",
  "xun4",
  "y",
  "ya",
  "ya1",
  "ya2",
  "ya3",
  "ya4",
  "yan1",
  "yan2",
  "yan3",
  "yan4",
  "yang",
  "yang1",
  "yang2",
  "yang3",
  "yang4",
  "yao1",
  "yao2",
  "yao3",
  "yao4",
  "ye",
  "ye1",
  "ye2",
  "ye3",
  "ye4",
  "yi",
  "yi1",
  "yi2",
  "yi3",
  "yi4",
  "yii",
  "yii2",
  "yin",
  "yin1",
  "yin2",
  "yin3",
  "yin4",
  "ying1",
  "ying2",
  "ying3",
  "ying4",
  "yo",
  "yo1",
  "yong1",
  "yong2",
  "yong3",
  "yong4",
  "you",
  "you1",
  "you2",
  "you3",
  "you4",
  "yu",
  "yu1",
  "yu2",
  "yu3",
  "yu4",
  "yuan1",
  "yuan2",
  "yuan3",
  "yuan4",
  "yue1",
  "yue2",
  "yue3",
  "yue4",
  "yum",
  "yun",
  "yun1",
  "yun2",
  "yun3",
  "yun4",
  "z",
  "za1",
  "za2",
  "za3",
  "za4",
  "zai1",
  "zai3",
  "zai4",
  "zan",
  "zan1",
  "zan2",
  "zan3",
  "zan4",
  "zang1",
  "zang3",
  "zang4",
  "zao1",
  "zao2",
  "zao3",
  "zao4",
  "ze",
  "ze2",
  "ze4",
  "zei2",
  "zen",
  "zen1",
  "zen3",
  "zen4",
  "zeng1",
  "zeng3",
  "zeng4",
  "zha",
  "zha1",
  "zha2",
  "zha3",
  "zha4",
  "zhai1",
  "zhai2",
  "zhai3",
  "zhai4",
  "zhan1",
  "zhan2",
  "zhan3",
  "zhan4",
  "zhang",
  "zhang1",
  "zhang3",
  "zhang4",
  "zhao",
  "zhao1",
  "zhao2",
  "zhao3",
  "zhao4",
  "zhe",
  "zhe1",
  "zhe2",
  "zhe3",
  "zhe4",
  "zhei4",
  "zhen1",
  "zhen3",
  "zhen4",
  "zheng1",
  "zheng3",
  "zheng4",
  "zhi",
  "zhi1",
  "zhi2",
  "zhi3",
  "zhi4",
  "zhong1",
  "zhong3",
  "zhong4",
  "zhou1",
  "zhou2",
  "zhou3",
  "zhou4",
  "zhu1",
  "zhu2",
  "zhu3",
  "zhu4",
  "zhua1",
  "zhua3",
  "zhuai1",
  "zhuai3",
  "zhuai4",
  "zhuan1",
  "zhuan3",
  "zhuan4",
  "zhuang1",
  "zhuang3",
  "zhuang4",
  "zhui1",
  "zhui3",
  "zhui4",
  "zhun1",
  "zhun3",
  "zhun4",
  "zhuo",
  "zhuo1",
  "zhuo2",
  "zi",
  "zi1",
  "zi2",
  "zi3",
  "zi4",
  "zip",
  "zi）",
  "zong",
  "zong1",
  "zong3",
  "zong4",
  "zou1",
  "zou3",
  "zou4",
  "zu1",
  "zu2",
  "zu3",
  "zu4",
  "zuan1",
  "zuan3",
  "zuan4",
  "zui",
  "zui1",
  "zui3",
  "zui4",
  "zun1",
  "zun2",
  "zun3",
  "zun4",
  "zuo",
  "zuo1",
  "zuo2",
  "zuo3",
  "zuo4",
  "~",
  "~~~～～",
  "¨",
  "¨,",
  "¨。",
  "·",
  "ê1",
  "ê2",
  "ê3",
  "ê4",
  "ē）",
  "ē，",
  "α",
  "β",
  "β。",
  "—",
  "——",
  "‘",
  "‘16",
  "’",
  "’。",
  "’？",
  "“",
  "“H”",
  "“Itch。\"",
  "“Spot”。",
  "“pretty”",
  "“pretty”？",
  "“！",
  "”",
  "”“",
  "”。",
  "”，",
  "”？",
  "…",
  "……",
  "……？",
  "⊙",
  "■",
  "、",
  "。",
  "。\"",
  "。;)",
  "。?",
  "。“",
  "。”",
  "。”“",
  "。”，",
  "。。",
  "。。。",
  "。。。？",
  "。」",
  "。」「",
  "。＂",
  "。（",
  "。）",
  "《",
  "》",
  "》。",
  "》：",
  "「",
  "「&」",
  "「?」",
  "「Muiriel」。",
  "「lorry」。",
  "」",
  "」?",
  "」。",
  "」「",
  "おごる",
  "㈠、",
  "﹐",
  "﹑",
  "﹣",
  "！",
  "！—",
  "！”",
  "！”“",
  "！」",
  "！」「",
  "！？",
  "＂",
  "＂。",
  "（",
  "（10021060）",
  "（10181079）",
  "（10191083）",
  "（10201077）",
  "（10311095）",
  "（10401075）",
  "（10491130）",
  "（10531102）",
  "（10531110）",
  "（10601128）",
  "（10791146）",
  "（10811159）",
  "（10821135）",
  "（1084",
  "（10901142）",
  "（11041162）",
  "（11121170）",
  "（11271206）",
  "（11281194）",
  "（11301200）",
  "（11321170）",
  "（11391193）",
  "（11401207）",
  "（11621227）",
  "（11701219）",
  "（11861249）",
  "（11871269）",
  "（11901244）",
  "（11921279）",
  "（12131275）",
  "（12261289）",
  "（12321297）",
  "（12361279）",
  "（12361283）",
  "（1248",
  "（12561301）",
  "（12701329）",
  "（127200）",
  "（12801354）",
  "（12871359）",
  "（12871368）",
  "（12961370）",
  "（13281398）",
  "（13321385）",
  "（13601424）",
  "（13631443）",
  "（13881462）",
  "（13971481）",
  "（14201506）",
  "（1427－1509）",
  "（14461512）",
  "（14591508）",
  "（14601526）",
  "（14701523）",
  "（14721529）",
  "（14731530）",
  "（14801567）",
  "（14981573）",
  "（15071560）",
  "（15091559）",
  "（15121594）",
  "（15141570）",
  "（15141587）",
  "（15181593）",
  "（15251560）",
  "（15251582）",
  "（15271602）",
  "（15271613）",
  "（15281587）",
  "（153208）",
  "（15341582）",
  "（15421616）",
  "（15451598）",
  "（15501620）",
  "（15511612）",
  "（155220）",
  "（15591626）",
  "（15681610）",
  "（15701641）",
  "（15741624）",
  "（15821664）",
  "（15841630）",
  "（1587?）",
  "（15921652）",
  "（15921680）",
  "（15971679）",
  "（15981652）",
  "（16021641）",
  "（16061647）",
  "（16081661）",
  "（16101680）",
  "（16181684）",
  "（16181704）",
  "（16191693）",
  "（16201664）",
  "（16211662）",
  "（16211696）",
  "（16241662）",
  "（16251682）",
  "（16261705）",
  "（16271703）",
  "（16291709）",
  "（16301696）",
  "（16311647）",
  "（16321718）",
  "（16331690）",
  "（16351704）",
  "（16381661）",
  "（16391695）",
  "（16401715）",
  "（16421715）",
  "（1642－1693）",
  "（16441694）",
  "（16531713）",
  "（16551685）",
  "（16781735）",
  "（16791726）",
  "（16871763）",
  "（169222）",
  "（16931765）",
  "（16951765）",
  "（17111799）",
  "（17151763）",
  "（17161798）",
  "（17251784）",
  "（17321815）",
  "（17331818）",
  "（17371805）",
  "（17441802）",
  "（17461803）",
  "（175210）",
  "（17601849）",
  "（17611802）",
  "（177217）",
  "（17821856）",
  "（17901878）",
  "（17941857）",
  "（18071859）",
  "（18111863）",
  "（18111865）",
  "（18111872）",
  "（18111882）",
  "（18121885）",
  "（18131881）",
  "（18141864）",
  "（18161861）",
  "（18181858）",
  "（18181884）",
  "（18201877）",
  "（18201879）",
  "（18221864）",
  "（18231856）",
  "（18231864）",
  "（18231896）",
  "（18241871）",
  "（18241890）",
  "（18251855）",
  "（18271868）",
  "（18281877）",
  "（18291884）",
  "（18311861）",
  "（18311863）",
  "（18311900）",
  "（18321899）",
  "（183245）",
  "（18331877）",
  "（18351908）",
  "（18361895）",
  "（18361918）",
  "（18371894）",
  "（18371917）",
  "（18381896）",
  "（18391890）",
  "（18411909）",
  "（18421922）",
  "（18441916）",
  "（18441927）",
  "（18451911）",
  "（18471917）",
  "（18501925）",
  "（18521924）",
  "（18531894）",
  "（18531926）",
  "（18541921）",
  "（18541923）",
  "（18551939）",
  "（18561875）",
  "（18561937）",
  "（18571898）",
  "（18571909）",
  "（18581927）",
  "（18591914）",
  "（18591928）",
  "（18601920）",
  "（18611919）",
  "（18611930）",
  "（18611933）",
  "（18621899）",
  "（18621938）",
  "（18631929）",
  "（18641912）",
  "（18641957）",
  "（18661910）",
  "（18661925）",
  "（18671895）",
  "（18671900）",
  "（18671906）",
  "（18671916）",
  "（18671921）",
  "（18671933）",
  "（18671945）",
  "（18671959）",
  "（18681924）",
  "（18681942）",
  "（18691936）",
  "（18701947）",
  "（18711918）",
  "（18721955）",
  "（18731907）",
  "（18731929）",
  "（18741952）",
  "（18751898）",
  "（18751905）",
  "（18751928）",
  "（18751963）",
  "（18761923）",
  "（18771925）",
  "（18771927）",
  "（18771933）",
  "（18781916）",
  "（18781938）",
  "（18781953）",
  "（18781967）",
  "（18791942）",
  "（18791951）",
  "（1879－1964）",
  "（18801911）",
  "（18801930）",
  "（18801969）",
  "（18801971）",
  "（18811911）",
  "（18811932）",
  "（18811973）",
  "（18821913）",
  "（18821938）",
  "（18821982）",
  "（18831911）",
  "（18831960）",
  "（18831962）",
  "（18831971）",
  "（18841911）",
  "（18841940）",
  "（18841942）",
  "（18841948）",
  "（18841970）",
  "（18851905）",
  "（18851935）",
  "（18851969）",
  "（18861911）",
  "（18861926）",
  "（18861956）",
  "（18861958）",
  "（18861960）",
  "（18861965）",
  "（18861975）",
  "（18861983）",
  "（18871910）",
  "（18871911）",
  "（18871944）",
  "（18871975）",
  "（18881912）",
  "（18881935）",
  "（18881937）",
  "（18881948）",
  "（18881967）",
  "（18891923）",
  "（18891927）",
  "（18891962）",
  "（18891968）",
  "（18891971）",
  "（18901942）",
  "（18901943）",
  "（18901969）",
  "（18901974）",
  "（18911934）",
  "（18911940）",
  "（18911949）",
  "（18921923）",
  "（18921936）",
  "（18921946）",
  "（18921951）",
  "（18921960）",
  "（18921964）",
  "（18921974）",
  "（18921982）",
  "（18931927）",
  "（18931949）",
  "（18931964）",
  "（18931969）",
  "（18931974）",
  "（18931979）",
  "（18931980）",
  "（18931988）",
  "（18941930）",
  "（18941932）",
  "（18941955）",
  "（18941962）",
  "（18941971）",
  "（18941988）",
  "（18951931）",
  "（18951932）",
  "（18951935）",
  "（18951944）",
  "（18951967）",
  "（18951975）",
  "（18951976）",
  "（18951997）",
  "（18961929）",
  "（18961931）",
  "（18961943）",
  "（18961946）",
  "（18961983）",
  "（18961984）",
  "（18961994）",
  "（18961995）",
  "（18971948）",
  "（18971957）",
  "（18971960）",
  "（18971968）",
  "（18971970）",
  "（18971977）",
  "（18971979）",
  "（18971984）",
  "（18971986）",
  "（18971987）",
  "（18971988）",
  "（18981925）",
  "（18981927）",
  "（18981941）",
  "（18981948）",
  "（18981954）",
  "（18981958）",
  "（18981974）",
  "（18981981）",
  "（18991946）",
  "（18991967）",
  "（18991970）",
  "（18991980）",
  "（18991983）",
  "（1900",
  "（19001928）",
  "（19001962）",
  "（19001965）",
  "（19001970）",
  "（19001975）",
  "（19001976）",
  "（19001977）",
  "（19001990）",
  "（19001995）",
  "（1900－1995）",
  "（1900－1997）",
  "（1901",
  "（19011927）",
  "（19011931）",
  "（19011944）",
  "（19011969）",
  "（19011972）",
  "（19011978）",
  "（19011980）",
  "（19011990）",
  "（1902",
  "（19021928）",
  "（19021931）",
  "（19021946）",
  "（19021955）",
  "（19021963）",
  "（19021976）",
  "（19021979）",
  "（19021983）",
  "（19021986）",
  "（19021988）",
  "（19021997）",
  "（19031961）",
  "（19031965）",
  "（19031975）",
  "（19031979）",
  "（19031982）",
  "（19031986）",
  "（19031989）",
  "（19041940）",
  "（19041967）",
  "（19041974）",
  "（19041982）",
  "（19041989）",
  "（19041992）",
  "（1905",
  "（19051925）",
  "（19051936）",
  "（19051940）",
  "（19051941）",
  "（19051942）",
  "（19051945）",
  "（19051966）",
  "（19051974）",
  "（19051980）",
  "（19051985）",
  "（19051994）",
  "（19051995）",
  "（1906",
  "（19061962）",
  "（19061967）",
  "（19061970）",
  "（19061978）",
  "（19061979）",
  "（19061982）",
  "（19061985）",
  "（19061988）",
  "（19061996）",
  "（19061997）",
  "（1906－",
  "（1907",
  "（19071942）",
  "（19071944）",
  "（19071978）",
  "（19071988）",
  "（19071991）",
  "（1908",
  "（19081969）",
  "（19081979）",
  "（19081994）",
  "（19091972）",
  "（19091977）",
  "（19091989）",
  "（19091992）",
  "（1910",
  "（19101943）",
  "（19101951）",
  "（19101977）",
  "（19101984）",
  "（19101988）",
  "（19101992）",
  "（19101996）",
  "（1911",
  "（19111942）",
  "（19111969）",
  "（19111993）",
  "（1912",
  "（19121944）",
  "（19121987）",
  "（19121988）",
  "（19121997）",
  "（19131951）",
  "（19131968）",
  "（19131974）",
  "（19131993）",
  "（19131996）",
  "（1914",
  "（19141956）",
  "（19141987）",
  "（19141995）",
  "（19141996）",
  "（1915",
  "（19151944）",
  "（19151957）",
  "（19151960）",
  "（19151969）",
  "（19151976）",
  "（19151980）",
  "（19151989）",
  "（1916",
  "（19161978）",
  "（19161982）",
  "（19161994）",
  "（1916－",
  "（1917",
  "（19171977）",
  "（19171984）",
  "（19171994）",
  "（1918",
  "（19181976）",
  "（1919",
  "（19191966）",
  "（19191975）",
  "（19201987）",
  "（19201996）",
  "（19201997）",
  "（1921",
  "（19211995）",
  "（1922",
  "（19221950）",
  "（19221980）",
  "（19221995）",
  "（1923",
  "（19231970）",
  "（19231971）",
  "（19231988）",
  "（1924",
  "（1925",
  "（1926",
  "（19261997）",
  "（1927",
  "（1927－",
  "（1928",
  "（19281954）",
  "（1929",
  "（1930",
  "（19301968）",
  "（19301975）",
  "（1931",
  "（1932",
  "（1933",
  "（19331996）",
  "（1934",
  "（19341987）",
  "（19341992）",
  "（1935",
  "（1936",
  "（19361985）",
  "（19361997）",
  "（1937",
  "（1938",
  "（19381989）",
  "（1939",
  "（1940",
  "（19401973）",
  "（1941",
  "（1942",
  "（19431991）",
  "（1944",
  "（19441994）",
  "（1945",
  "（1949",
  "（1951",
  "（1952",
  "（1954",
  "（1956",
  "（1957",
  "（1959",
  "（1962",
  "（1963",
  "（1970",
  "（1972",
  "（1973",
  "（1974",
  "（1975",
  "（202264）",
  "（224271）",
  "（233297）",
  "（236290）",
  "（247300）",
  "（261303）",
  "（27",
  "（271318）",
  "（274333）",
  "（276322）",
  "（284364）",
  "（320385）",
  "（325375）",
  "（327388）",
  "（34156）",
  "（343388）",
  "（363422）",
  "（372451）",
  "（384456）",
  "（385433）",
  "（421466）",
  "（427482）",
  "（429500）",
  "（441513）",
  "（464549）",
  "（496547）",
  "（501531）",
  "（503559）",
  "（507556）",
  "（519594）",
  "（531590",
  "（535586）",
  "（540609）",
  "（541604）",
  "（553604）",
  "（557641）",
  "（566635）",
  "（569618）",
  "（571649）",
  "（581682）",
  "（585658）",
  "（599649）",
  "（602664）",
  "（614683）",
  "（624705）",
  "（638713）",
  "（650",
  "（650693",
  "（659700）",
  "（675?750?）",
  "（678740）",
  "（678747）",
  "（685762）",
  "（688742）",
  "（689740）",
  "（692756）",
  "（701",
  "（709757）",
  "（709785）",
  "（719756）",
  "（732789）",
  "（748",
  "（773819）",
  "（774835）",
  "（776826）",
  "（778865）",
  "（78139）",
  "（790816）",
  "（833910）",
  "（837908）",
  "（837?）",
  "（852912）",
  "（872926）",
  "（873954）",
  "（892942）",
  "（919967）",
  "（921959）",
  "（922992）",
  "（927976）",
  "（9531009）",
  "（9671029）",
  "（9901078）",
  "（9911055）",
  "（?",
  "（?1110）",
  "（?1279）",
  "（?184）",
  "（?1863）",
  "（?192）",
  "（?202）",
  "（?217）",
  "（?221）",
  "（?227）",
  "（?229）",
  "（?310）",
  "（?336）",
  "（?638）",
  "（?673）",
  "（?752）",
  "（?754）",
  "（?866）",
  "（?917）",
  "（?986）",
  "（?989）",
  "（Angklung）",
  "（Bouzouki）",
  "（Cimbalom）",
  "（Crwth）",
  "（Didgeridoo）",
  "（Djembe）",
  "（Dutar）",
  "（GIS）",
  "（GPS）",
  "（GPU）",
  "（Hackbrett）",
  "（Hang",
  "（Oud）",
  "（Qanun）",
  "（RPA）",
  "（Santur）",
  "（Sarangi）",
  "（Sitar）",
  "（Steelpan）",
  "（Tamborim）",
  "（Tambura）",
  "（Theremin）",
  "（Tin",
  "（VPN）",
  "（Vibraslap）",
  "（Waterphone）",
  "（achilleus）",
  "（atlas）",
  "（bi",
  "（bo",
  "（b：ng",
  "（b：o",
  "（chi）",
  "（chu：n",
  "（ch：ng",
  "（ci",
  "（cuo",
  "（d",
  "（d：",
  "（d：ng",
  "（e",
  "（fdd3）",
  "（g",
  "（g：",
  "（h",
  "（hu",
  "（h：n）",
  "（h：o）",
  "（ji",
  "（ji：n",
  "（ji：ng）",
  "（jupiter）",
  "（kadmos）",
  "（klidsa）",
  "（kui）",
  "（kui）：",
  "（k：i",
  "（k：n）",
  "（l",
  "（ld",
  "（li",
  "（li：o",
  "（long）",
  "（l：",
  "（l：o",
  "（medusa）",
  "（mie）",
  "（myron）",
  "（m：",
  "（m：o",
  "（n",
  "（ni",
  "（ni）",
  "（ni：n",
  "（n：n",
  "（pelé，1940",
  "（pin",
  "（p：n）",
  "（p：o",
  "（q",
  "（qi：n",
  "（qi：o",
  "（qi：o）",
  "（rui",
  "（sun）",
  "（t",
  "（theseus）",
  "（ti",
  "（ti：o",
  "（t：i）",
  "（t：）",
  "（wu",
  "（xi：ng）",
  "（xu：n）",
  "（x：n",
  "（y：o）",
  "（zhu",
  "（zhu：i",
  "（zh：n）",
  "（zu：n",
  "（zu：n）",
  "（z：n）",
  "（áｏáｏ）",
  "（è）",
  "（ē）",
  "（ě）",
  "（ōｕｙā）",
  "（－ｃｈǎｎｇ）",
  "（－ｈèｎｇ）",
  "（－ｊｉàｎ）",
  "（－ｊｉàｏ）",
  "（－ｍáｎｇ）",
  "（－ｎàｎ）",
  "（－ｓｈàｏ）",
  "（－ｓｈｕì）",
  "（－ｙīｎｇ）",
  "（－ｙｕáｎ）",
  "（－ｚｈòｎｇ）",
  "（：n",
  "（ｂì）",
  "（ｂōｂō）",
  "（ｃàｎ）",
  "（ｃｈáｎ）",
  "（ｃｈèｎ）",
  "（ｃｈóｎｇ）",
  "（ｃｈāｃｈā）",
  "（ｃｈāｉ）",
  "（ｃｈǎｎｇ）",
  "（ｃｕáｎ）",
  "（ｄàｉ）",
  "（ｄàｎｇ）",
  "（ｄàｏ）",
  "（ｄòｕ）",
  "（ｄī）",
  "（ｄｉàｏ）",
  "（ｄｕó）",
  "（ｆà－）",
  "（ｆｕ）",
  "（ｇù）",
  "（ｇāｇā）",
  "（ｇū）",
  "（ｇｕāｎ）",
  "（ｈàｎｇ）",
  "（ｈàｏ）",
  "（ｈá）",
  "（ｈáｎｇ）",
  "（ｈè）",
  "（ｈùｎ）",
  "（ｈǎ）",
  "（ｊí）",
  "（ｊù）",
  "（ｊī）",
  "（ｊｉàｎ）",
  "（ｊｉàｎｇ）",
  "（ｊｉàｏ）",
  "（ｊｉāｎｇ－）",
  "（ｊｕàｎ）",
  "（ｊｕé－）",
  "（ｋòｎｇ）",
  "（ｋāｎ）",
  "（ｌàｏ）",
  "（ｌèｉ）",
  "（ｌíｎｇ）",
  "（ｌòｕ）",
  "（ｌúｎ－）",
  "（ｌǒｎｇ）",
  "（ｌｉáｎｇ’āｎ）",
  "（ｌｉáｎｇ）",
  "（ｌｉáｏ）",
  "（ｌｕò）",
  "（ｍéｎｍéｎ）",
  "（ｍò",
  "（ｍā）",
  "（ｎàｎ）",
  "（ｎｉù）",
  "（ｐáｏ）",
  "（ｐí）",
  "（ｐō）",
  "（ｐǐ）",
  "（ｐｉàｏ）",
  "（ｐｉàｏ－）",
  "（ｐｉāｏ）",
  "（ｑí）",
  "（ｑǔ）",
  "（ｑｉàｎ）",
  "（ｑｉè）",
  "（ｑｉé）",
  "（ｑｉǎ）",
  "（ｑｉǎｎｇ）",
  "（ｓàｉ）",
  "（ｓàｏｚｉ）",
  "（ｓè）",
  "（ｓｈàｎ－）",
  "（ｓｈàｏ）",
  "（ｓｈàｏｙｅ）",
  "（ｓｈè）",
  "（ｓｈéｎ）",
  "（ｓｈí）",
  "（ｓｈǔ）",
  "（ｓｈｕà）",
  "（ｓｕō）",
  "（ｔà－）",
  "（ｔú）",
  "（ｔā）",
  "（ｔāｏ）",
  "（ｔｉáｎ",
  "（ｔｉǎｏ）",
  "（ｔｕō－）",
  "（ｗùｌａ）",
  "（ｗú）",
  "（ｗǎｎ）",
  "（ｘìｎｇ）",
  "（ｘī",
  "（ｘǐｎｇ）",
  "（ｘｉàｎｇ）",
  "（ｙàｎ）",
  "（ｙàｎｇ）",
  "（ｙè）",
  "（ｙéｈǔ）",
  "（ｙìｎ）",
  "（ｙóｕ）",
  "（ｙù）",
  "（ｙú）",
  "（ｙāｎｚｈī）",
  "（ｙāｏ）",
  "（ｙēｙē）",
  "（ｙǎｎｇ－）",
  "（ｙǐ－）",
  "（ｙǔ）",
  "（ｚā）",
  "（ｚｈá）",
  "（ｚｈáｏ）",
  "（ｚｈì－）",
  "（ｚｈòｎｇ）",
  "（ｚｈā）",
  "（ｚｈāｏ）",
  "（ｚｈē－）",
  "（ｚｈēｎｇ）",
  "（ｚｈēｎｇ－）",
  "（ｚｈēｎｇｚｈá）",
  "（ｚｈǎｎｇ）",
  "（ｚｈǔ）",
  "（ｚｈǔｈè）",
  "（ｚｈｕàｎ",
  "（ｚｈｕàｎ）",
  "（ｚｈｕó）",
  "（ｚｈｕī－）",
  "）",
  "）。",
  "）：",
  "）；",
  "，",
  "，20",
  "，2001",
  "，6",
  "，AA",
  "，Dennis",
  "，Ian。",
  "，Ken",
  "，Muiriel！",
  "，Raphael！",
  "，Roger。",
  "，Shishir。",
  "，Tom",
  "，Trang。",
  "，“",
  "，”",
  "，。",
  "，」",
  "－",
  "．",
  "／",
  "１、３、５",
  "８０",
  "：",
  "：\"",
  "：_____。",
  "：·",
  "：‘",
  "：“",
  "：「",
  "：（",
  "；",
  "；；",
  "？",
  "？\"",
  "？-",
  "？10",
  "？”",
  "？”——“",
  "？”“",
  "？”“8",
  "？。",
  "？」",
  "？」「",
  "？！",
  "Ｂ",
  "Ｍ",
  "ＱＱ",
  "ＱＱ。",
  "ｂàｏ）",
  "ｂēｉ）",
  "ｃｈóｎｇ）",
  "ｄàｏ）",
  "ｄì）",
  "ｄòｕ）",
  "ｆà）",
  "ｈàｏ）",
  "ｈáｉ）",
  "ｈáｎｇ）",
  "ｈèｎｇ）",
  "ｈｕ）",
  "ｊī）",
  "ｊｉàｎｇ）",
  "ｊｕàｎ）",
  "ｋｕǐ）",
  "ｌá）",
  "ｌù）",
  "ｌｉáｎｇ）",
  "ｌｕō）",
  "ｍéｉ）",
  "ｍěｎｇ）",
  "ｎàｎ）",
  "ｎｉāｎ）",
  "ｐíｎｇ）",
  "ｐǎｉ）",
  "ｐｉàｏ）",
  "ｐｉáｎ）",
  "ｑí）",
  "ｑｉǎｎｇ）",
  "ｓàｉ）",
  "ｓｈà）",
  "ｓｈàｏ）",
  "ｓｈě）",
  "ｓｈǔ）",
  "ｓｈｕò）",
  "ｔáｉ）",
  "ｔｉáｎ）",
  "ｗèｉ）",
  "ｘī）",
  "ｘｕàｎ）",
  "ｙá）",
  "ｙì）",
  "ｙāｎ）",
  "ｚｈàｎｇ）",
  "ｚｈáｏ）",
  "ｚｈòｎｇ）",
  "ｚｈāｎ）",
  "ｚｈī）",
  "ｚｉ）",
  "～"
]